In [1]:
import pandas as pd
import numpy as np

In [2]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')
date.head()

   Unnamed: 0        date  product_id  city_id  orders
0           0  2019-12-10        5628       25       3
1           1  2018-08-15        3646       14     157
2           2  2018-10-23        1859       25       1
3           3  2019-08-17        7292       25       1
4           4  2019-01-06        4344       25       3

In [3]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  1000 non-null   int64
 1   date        1000 non-null   object
 2   product_id  1000 non-null   int64
 3   city_id     1000 non-null   int64
 4   orders      1000 non-null   int64
dtypes: int64(4), object(1)
memory usage: 39.2+ KB

In [4]:
date.drop(columns=['Unnamed: 0'], inplace=True)

#### Here we can see `date` is the object type variable. Its need to convert into date format

In [5]:
date.head(1)

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3

In [6]:
date['date'] = pd.to_datetime(date['date'])
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

### Extract Year

In [7]:
date['date_year'] = date['date'].dt.year
date.head(1)

        date  product_id  city_id  orders  date_year
0 2019-12-10        5628       25       3       2019

In [8]:
date['month'] = date['date'].dt.month
date.head(1)

        date  product_id  city_id  orders  date_year  month
0 2019-12-10        5628       25       3       2019     12

In [9]:
date['month_name'] = date['date'].dt.month_name()
date.head(1)

        date  product_id  city_id  orders  date_year  month month_name
0 2019-12-10        5628       25       3       2019     12   December

### Extract Day

In [10]:
date['date_day'] = date['date'].dt.day
date.head(1)

,date,product_id,city_id,orders,date_year,month,month_name,date_day
0,2019-12-10,5628,25,3,2019,12,December,10

In [11]:
## day of week
date['date_day_of_week'] = date['date'].dt.dayofweek
date.head(1)

,date,product_id,city_id,orders,date_year,month,month_name,date_day,date_day_of_week
0,2019-12-10,5628,25,3,2019,12,December,10,1

In [12]:
# day of week - name

date['date_dow_name'] = date['date'].dt.day_name()

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,month,month_name,date_day,date_day_of_week,date_dow_name
0,2019-12-10,2019,12,December,10,1,Tuesday
1,2018-08-15,2018,8,August,15,2,Wednesday
2,2018-10-23,2018,10,October,23,1,Tuesday
3,2019-08-17,2019,8,August,17,5,Saturday
4,2019-01-06,2019,1,January,6,6,Sunday

In [13]:
# is weekend?
date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday', 'Saturday']), 1,0)

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,month,month_name,date_day,date_day_of_week,date_dow_name,date_is_weekend
0,2019-12-10,2019,12,December,10,1,Tuesday,0
1,2018-08-15,2018,8,August,15,2,Wednesday,0
2,2018-10-23,2018,10,October,23,1,Tuesday,0
3,2019-08-17,2019,8,August,17,5,Saturday,1
4,2019-01-06,2019,1,January,6,6,Sunday,1

In [14]:
time.head(1)

   Unnamed: 0                 date                       msg
0           0  2013-12-15 00:50:00  ищу на сегодня мужика 37

In [15]:
time.drop(columns=['Unnamed: 0'], inplace=True)
time.head(1)

                  date                       msg
0  2013-12-15 00:50:00  ищу на сегодня мужика 37

In [18]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [19]:
time['date'] = pd.to_datetime(time['date'])
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [20]:
import datetime

today = datetime.datetime.today()
today

datetime.datetime(2025, 1, 28, 13, 11, 8, 761456)

In [21]:
today - date['date']

0     1876 days 13:11:08.761456
1     2358 days 13:11:08.761456
2     2289 days 13:11:08.761456
3     1991 days 13:11:08.761456
4     2214 days 13:11:08.761456
                 ...
995   2304 days 13:11:08.761456
996   2245 days 13:11:08.761456
997   2093 days 13:11:08.761456
998   2158 days 13:11:08.761456
999   1932 days 13:11:08.761456
Name: date, Length: 1000, dtype: timedelta64[ns]

In [22]:
(today - date['date']).dt.days

0      1876
1      2358
2      2289
3      1991
4      2214
       ...
995    2304
996    2245
997    2093
998    2158
999    1932
Name: date, Length: 1000, dtype: int64

In [23]:
time.head(1)

                 date                       msg
0 2013-12-15 00:50:00  ищу на сегодня мужика 37

In [24]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['second'] = time['date'].dt.second
time.head(1)

                 date                       msg  hour  min  second
0 2013-12-15 00:50:00  ищу на сегодня мужика 37     0   50       0

In [25]:
## Extract date
time['date_only'] = time['date'].dt.date
time.head(1)

                 date                       msg  hour  min  second   date_only
0 2013-12-15 00:50:00  ищу на сегодня мужика 37     0   50       0  2013-12-15